pjclavero/Diana/firmware/esp32/main/app_tasks.c
    /* Sin UUID con que correlar, este resultado no sirve para nada: el panel no
     * podria distinguirlo de la respuesta a otra orden. Se calla en vez de
     * publicar algo incorrelable, igual que hace el rechazo. */
    if (!request_id || !diana_is_uuid(request_id)) {
        ESP_LOGW(TAG, "resultado de mantenimiento sin request_id valido: "
                      "no se publica (seria incorrelable)");
        return;
    }
    d.has_request_id = true;
    snprintf(d.request_id, sizeof(d.request_id), "%s", request_id);

    d.detail_keys[d.detail_count] = "result";
    d.detail_str[d.detail_count++] = "ok";
    d.detail_keys[d.detail_count] = "component";
    d.detail_str[d.detail_count++] = component;
    if (target_index > 0) {
        d.detail_keys[d.detail_count] = "target_index";
        d.detail_str[d.detail_count] = NULL;
        d.detail_num[d.detail_count++] = target_index;
    }
    if (duration_ms > 0) {
        d.detail_keys[d.detail_count] = "duration_ms";
        d.detail_str[d.detail_count] = NULL;
        d.detail_num[d.detail_count++] = (int64_t)duration_ms;
    }

    char *buf = alloc_message_buffer();
    if (!buf) return;
    size_t n = diana_diagnostic_json(&d, &a->id,
                                     a->hal.now_us(a->hal.ctx) - a->boot_us,
                                     buf, DIANA_MSG_JSON_MAX);
    /* Un diagnostico que no serializa se DICE. El silencio de este camino es
     * lo que oculto durante toda una tanda que los rechazos de mantenimiento
     * no salian del modulo: el serializador los rechazaba por incorrelables
     * --- con razon --- y aqui se tiraban sin dejar rastro. */
    if (n) publish(a, a->topic_diagnostic, buf, n, DIANA_TOPIC_DIAGNOSTIC);
    else   ESP_LOGE(TAG, "diagnostico '%s' NO serializado: se descarta",
                    diana_diagnostic_kind_str(d.kind));
    free(buf);
}

void diana_publish_diagnostic(diana_app *a, diana_diagnostic_kind kind,
                              diana_severity sev, const char *message)
{
    diana_diagnostic d;
    diana_diagnostic_init(&d, &a->hal, kind, sev, message);
    char *buf = alloc_message_buffer();
    if (!buf) return;
    size_t n = diana_diagnostic_json(&d, &a->id,
                                     a->hal.now_us(a->hal.ctx) - a->boot_us,
                                     buf, DIANA_MSG_JSON_MAX);
    /* Un diagnostico que no serializa se DICE. El silencio de este camino es
     * lo que oculto durante toda una tanda que los rechazos de mantenimiento
     * no salian del modulo: el serializador los rechazaba por incorrelables
     * --- con razon --- y aqui se tiraban sin dejar rastro. */
    if (n) publish(a, a->topic_diagnostic, buf, n, DIANA_TOPIC_DIAGNOSTIC);
    else   ESP_LOGE(TAG, "diagnostico '%s' NO serializado: se descarta",
                    diana_diagnostic_kind_str(d.kind));
    free(buf);
}

void diana_publish_config_reported(diana_app *a)
{
    char *buf = alloc_message_buffer();
    if (!buf) return;
    size_t n = diana_config_reported_json(&a->cfg, a->id.module_id, NULL, buf,
                                          DIANA_MSG_JSON_MAX);
    if (n) publish(a, a->topic_config_reported, buf, n,
                   DIANA_TOPIC_CONFIG_REPORTED);
    free(buf);
}

/* ------------------------------------------------------------------ sensores */

/** Publica el evento, o lo encola si no hay red (dosier 14.3). */
static void emit_hit(diana_app *a, const diana_hit_event *ev)
{
    if (diana_hit_event_check(ev) != DIANA_HAL_OK) {
        /* Un evento que no cumple el contrato NO se envia: se registra. */
        diana_publish_diagnostic(a, DIANA_DIAG_SCHEMA_REJECTED, DIANA_SEV_ERROR,
                                 "evento propio no conforme: descartado");
        return;
    }

    char json[DIANA_HIT_JSON_MAX];
    size_t n = diana_hit_event_to_json(ev, json, sizeof(json));
    if (n == 0) return;

    if (a->hal.mqtt_connected(a->hal.ctx)) {
        diana_hal_mqtt_msg msg = {a->topic_hit, json, n, 1, false};
        if (a->hal.mqtt_publish(a->hal.ctx, &msg) >= 0) {
            diana_queue_remember(&a->queue, ev->event_id);
            return;
        }
    }
    int rc = diana_queue_push(&a->queue, ev);
    if (rc == DIANA_HAL_ERR_NO_SPACE) {
        diana_publish_diagnostic(a, DIANA_DIAG_QUEUE_OVERFLOW, DIANA_SEV_ERROR,
                                 "cola local llena: evento perdido");
    }
}

void diana_task_sensors(void *arg)
{
    diana_app *a = (diana_app *)arg;
    esp_task_wdt_add(NULL);
    uint16_t last_logged_raw = 0xffffu;
    uint16_t last_logged_used = 0xffffu;
    uint64_t last_diag_us = 0;

    for (;;) {
        esp_task_wdt_reset();

        diana_platform_trigger t;
        bool got = diana_platform_trigger_pop(a->pf, &t, DIANA_HC165_POLL_MS);
        if (!got) continue;

        uint16_t used_raw = (uint16_t)(t.raw_bitmap & 0x01ffu);
        bool used_changed = used_raw != last_logged_used;
        bool raw_changed = t.raw_bitmap != last_logged_raw;
        bool diag_due = (t.t_us - last_diag_us) >= 250000ULL;
        if (used_changed || (raw_changed && diag_due)) {
            diana_do_snapshot snap;
            diana_do_decode(t.raw_bitmap, DIANA_DO_POLARITY, &snap);
            uint16_t active_high = diana_do_active_bitmap(t.raw_bitmap,
                                                          DIANA_DO_ACTIVE_HIGH);
            uint16_t active_low = diana_do_active_bitmap(t.raw_bitmap,
                                                         DIANA_DO_ACTIVE_LOW);
            ESP_LOGI(TAG, "SENSORES raw=0x%04x bits16=" SENSOR16_BITS_PATTERN
                     " raw D9..D1=" SENSOR9_BITS_PATTERN
                     " AH=" SENSOR9_BITS_PATTERN
                     " AL=" SENSOR9_BITS_PATTERN
                     " cfg=%s count=%u",
                     (unsigned)t.raw_bitmap, SENSOR16_BITS(t.raw_bitmap),
                     SENSOR9_BITS(used_raw),
                     SENSOR9_BITS(active_high),
                     SENSOR9_BITS(active_low),
                     DIANA_DO_POLARITY == DIANA_DO_ACTIVE_HIGH ? "AH" : "AL",
                     (unsigned)snap.active_count);
            last_logged_raw = t.raw_bitmap;
            last_logged_used = used_raw;
            last_diag_us = t.t_us;
        }

        diana_hit_group grp;
        diana_do_process_snapshot(&a->sensors, &a->cfg, t.raw_bitmap,
                                  DIANA_DO_POLARITY, t.t_us, &grp);

        if (!grp.accepted) {
            if (grp.target_index == 0 && strstr(grp.reason, "MULTI_TRIGGER") != NULL)
                diana_publish_diagnostic(a, DIANA_DIAG_SENSOR_ERROR,
                                         DIANA_SEV_WARNING, grp.reason);
            continue;
        }

