pjclavero/Diana/firmware/esp32/main/app_tasks.c
        diana_target *tg = diana_target_at(&a->targets, grp.target_index);
        if (!tg) continue;
        diana_target_state before = tg->state;
        uint64_t now = a->hal.now_us(a->hal.ctx);

        /* Clasificacion segun el estado de la diana y de la partida. */
        if (a->fsm.state == DIANA_MODULE_GAME_PAUSED) {
            grp.classification = DIANA_HIT_DURING_PAUSE;
            snprintf(grp.reason, sizeof(grp.reason), "partida en pausa");
        } else if (a->fsm.state == DIANA_MODULE_CALIBRATION) {
            grp.classification = DIANA_HIT_CALIBRATION;
            snprintf(grp.reason, sizeof(grp.reason), "impacto de calibracion");
        } else if (before == DIANA_TARGET_SAFE) {
            grp.classification = DIANA_HIT_ON_SAFE;
            snprintf(grp.reason, sizeof(grp.reason), "diana en estado seguro");
            diana_target_apply(tg, DIANA_TEV_HIT_PENALTY, now);
        } else if (before == DIANA_TARGET_HIT) {
            grp.classification = DIANA_HIT_ON_ALREADY_HIT;
            snprintf(grp.reason, sizeof(grp.reason), "diana ya alcanzada");
        } else if (!diana_target_is_scorable(tg)) {
            grp.classification = DIANA_HIT_OUT_OF_ORDER;
            snprintf(grp.reason, sizeof(grp.reason), "diana no activa (%s)",
                     diana_target_state_str(before));
        } else {
            diana_target_apply(tg, DIANA_TEV_HIT_VALID, now);
        }

        diana_hit_event ev;
        diana_hit_event_build(&ev, &a->hal, &a->id, &grp, before, now);
        if (a->cfg.has_position) {
            ev.has_position = true;
            ev.position_x = a->cfg.position_x;
            ev.position_y = a->cfg.position_y;
        }
        ev.has_rotation = true;
        ev.rotation = a->cfg.rotation;
        emit_hit(a, &ev);

        /* Los vecinos descartados se publican para poder auditar la decision. */
        for (uint8_t i = 0; i < grp.rejected_count; ++i) {
            diana_hit_event rej;
            const diana_target *rtg =
                diana_target_at_const(&a->targets, grp.rejected_index[i]);
            if (diana_hit_event_build_rejected(&rej, &a->hal, &a->id, &grp, i,
                                               rtg ? rtg->state : DIANA_TARGET_OFF,
                                               now))
                emit_hit(a, &rej);
        }
    }
}

/* ---------------------------------------------------------------------- LED */

void diana_task_leds(void *arg)
{
    diana_app *a = (diana_app *)arg;
    esp_task_wdt_add(NULL);

    for (;;) {
        esp_task_wdt_reset();
        uint64_t now = a->hal.now_us(a->hal.ctx);
        uint64_t t_ms = now / 1000ULL;

        if (a->identify_active && now > a->identify_until_us)
            a->identify_active = false;
        /* Cada diana caduca por su cuenta: el vencimiento de una no puede
         * apagar a otra. Se construye aqui la mascara que consume el render. */
        uint16_t test_mask = 0;
        for (uint8_t i = 0; i < DIANA_TARGET_COUNT; ++i) {
            if (a->led_test_until_us[i] == 0) continue;
            if (now > a->led_test_until_us[i]) {
                a->led_test_until_us[i] = 0;
                continue;
            }
            test_mask |= (uint16_t)(1u << i);
        }

#if CONFIG_DIANA_BENCH_HIT_LED_TEST
        for (uint8_t i = 0; i < 3; ++i) {
            diana_target *tg = &a->targets.t[i];
            if (tg->state == DIANA_TARGET_HIT &&
                now - tg->entered_at_us >= 1000000ULL) {
                diana_target_apply(tg, DIANA_TEV_HIT_CLEARED, now);
                diana_target_apply(tg, DIANA_TEV_ARM, now);
                ESP_LOGI(TAG, "BANCO D%u rearmada", (unsigned)(i + 1u));
            }
        }
#endif

        diana_target_state states[DIANA_TARGET_COUNT];
        for (int i = 0; i < DIANA_TARGET_COUNT; ++i)
            states[i] = a->targets.t[i].state;

        diana_hal_rgb px[DIANA_LED_CHAINS][DIANA_LEDS_PER_CHAIN];
        for (uint8_t c = 0; c < DIANA_LED_CHAINS; ++c)
            diana_led_render_chain(c, states,
                                   a->identify_active || a->identify_button_active,
                                   test_mask,
                                   a->cfg.led_brightness_max, t_ms, px[c]);

        /* Presupuesto de potencia ANTES de escribir: nunca se envia al hardware
         * un fotograma que exceda la corriente disponible (dosier 10.4). */
        diana_hal_rgb *chains[DIANA_LED_CHAINS] = {px[0], px[1], px[2]};
        diana_led_apply_budget(chains, DIANA_LEDS_PER_CHAIN, DIANA_LED_BUDGET_MA);

        for (uint8_t c = 0; c < DIANA_LED_CHAINS; ++c)
            a->hal.led_write(a->hal.ctx, c, px[c], DIANA_LEDS_PER_CHAIN);
        diana_platform_led_refresh(a->pf);

        vTaskDelay(pdMS_TO_TICKS(20));   /* 50 fps */
    }
}

/* ------------------------------------------------------------------- red */

void diana_task_network(void *arg)
{
    diana_app *a = (diana_app *)arg;
    esp_task_wdt_add(NULL);

    bool was_connected = false;

    for (;;) {
        esp_task_wdt_reset();
        bool connected = a->hal.mqtt_connected(a->hal.ctx);

        if (connected && !was_connected) {
            /* Reconexion: presencia, estado, config y vaciado de la cola. */
            a->mqtt_reconnects++;
            diana_module_fsm_apply(&a->fsm, DIANA_EV_MQTT_CONNECTED,
                                   a->hal.now_us(a->hal.ctx));
            diana_publish_presence(a, DIANA_PRESENCE_CONNECT);
            diana_module_fsm_apply(&a->fsm, DIANA_EV_REGISTERED,
                                   a->hal.now_us(a->hal.ctx));
            diana_publish_status(a);
            diana_publish_config_reported(a);
            /* v1.2 · ADR-0008: al (re)conectar se declara el estado de
             * autoridad si hay algo que declarar. Es reported state
             * observacional, jamas una orden. */
            diana_prov_app_announce(a);
            ESP_LOGI(TAG, "reconectado: vaciando %u eventos pendientes",
                     (unsigned)diana_queue_depth(&a->queue));
            /* La cola persistente se liga a la identidad ACTUAL en cada
             * conexion: si el modulo se reaprovisiono, lo que quedo dentro es
             * de otro y no puede salir en su nombre. */
            diana_queue_bind_identity(&a->queue, a->id.module_id, a->id.system_id);
        } else if (!connected && was_connected) {
            diana_module_fsm_apply(&a->fsm, DIANA_EV_MQTT_DISCONNECTED,
                                   a->hal.now_us(a->hal.ctx));
        }
        was_connected = connected;

        if (connected && diana_queue_depth(&a->queue) > 0) {
            /* Vaciado por lotes: no monopoliza la red ni el watchdog. */
            diana_queue_flush(&a->queue, a->topic_hit, 8);
            /* Diagnostico UNA sola vez: si se registrara en cada vaciado, una
             * cola con eventos de otra identidad llenaria el log para siempre
             * --- que es exactamente el sintoma que esto viene a cerrar. */
            if (a->queue.stale_identity > 0 && !a->queue.stale_reported) {
                a->queue.stale_reported = true;
                ESP_LOGW(TAG,
                         "cola: %u evento(s) retirados por pertenecer a OTRA "
                         "identidad; la actual es '%s'/'%s'",
                         (unsigned)a->queue.stale_identity, a->id.module_id,
                         a->id.system_id);
            }
        }

        /* FUERA DE LA PILA. Un diana_platform_rx son ~4.3 KB desde que el
         * buffer de recepcion se dimensiono contra el contrato, y la pila de
         * diana_net son 8 KB: en la placa esto desbordo con
         * "A stack overflow in task diana_net has been detected" justo despues
         * de las suscripciones, en cuanto llego el primer mensaje. `static` es
         * seguro porque diana_task_network es la UNICA tarea que ejecuta esta
         * funcion; si algun dia deja de serlo, hay que volver aqui. */
        static diana_platform_rx rx;
        while (diana_platform_rx_pop(a->pf, &rx, 20))
            diana_handle_message(a, &rx);

        /* Rollback automatico si la OTA no se confirma a tiempo. */
        diana_ota_tick(&a->ota, a->hal.now_us(a->hal.ctx));

        vTaskDelay(pdMS_TO_TICKS(20));
    }
}

