pjclavero/Diana/firmware/esp32/main/app_tasks.c
/* ------------------------------------------------------------- telemetria */

/* Cadencia de la lectura diagnostica de VERSIONR: 30 s. Ni se acopla a la
 * telemetria (1 s por defecto) ni necesita un bucle propio. */
#define DIANA_VERSIONR_PERIOD_US (30ULL * 1000ULL * 1000ULL)

void diana_task_telemetry(void *arg)
{
    diana_app *a = (diana_app *)arg;
    esp_task_wdt_add(NULL);
    uint64_t last_versionr_us = 0;
    /* Arranca en true para que el PRIMER paso por el bucle anuncie el estado
     * real: el modulo arranca siempre sin hora, y un "false -> false" silencioso
     * dejaria el caso normal sin registrar. */
    bool clock_valido_anterior = true;

    for (;;) {
        esp_task_wdt_reset();

        diana_telemetry_input in;
        memset(&in, 0, sizeof(in));
        in.id = &a->id;
        uint64_t now = a->hal.now_us(a->hal.ctx);
        in.uptime_us = now - a->boot_us;
        in.uptime_s = in.uptime_us / 1000000ULL;
        a->hal.health(a->hal.ctx, &in.health);

        diana_hal_net_status net;
        a->hal.net_status(a->hal.ctx, &net);
        in.link_up = net.link_up;
        in.mqtt_reconnects = a->mqtt_reconnects;
        in.queue_depth = diana_queue_depth(&a->queue);
        for (int c = 0; c < DIANA_LED_CHAINS; ++c) in.chain_ok[c] = true;
        in.has_chain_current = false;   /* sin medida real de corriente por cadena */

        char *buf = alloc_message_buffer();
        size_t n = buf ? diana_telemetry_json(&in, buf, DIANA_MSG_JSON_MAX) : 0;
        if (n) publish(a, a->topic_telemetry, buf, n, DIANA_TOPIC_TELEMETRY);
        free(buf);

        if (in.health.has_voltage && in.health.voltage_5v_mv < 4600) {
            diana_publish_diagnostic(a, DIANA_DIAG_LOW_VOLTAGE, DIANA_SEV_WARNING,
                                     "5V por debajo de 4,6 V");
        }

        /* VERSIONR con cadencia PROPIA y lenta, decimada dentro de la tarea de
         * telemetria. Deliberadamente NO se ata a telemetry_interval_ms, que
         * por defecto es 1000 ms: leer un registro por SPI una vez por segundo
         * seria sondeo agresivo y competiria con el trafico del driver. Es UNA
         * lectura cada DIANA_VERSIONR_PERIOD_US, por el mismo camino SPI y bajo
         * el mismo mutex. Sirve para detectar en caliente una degradacion
         * 0x04 -> 0x00 durante la endurance, invisible de otro modo. */
        /* CLOCK_VALID observable. Sin esto, "el modulo no tiene hora" solo se
         * podia deducir de que los comandos 'act' se rechazaban --- es decir,
         * por su consecuencia y no por su causa. La transicion se anuncia UNA
         * vez, para no convertir el log en un goteo. */
        {
            uint64_t epoch = a->hal.epoch_ms ? a->hal.epoch_ms(a->hal.ctx) : 0;
            bool valido = (epoch > 0);
            if (valido != clock_valido_anterior) {
                clock_valido_anterior = valido;
                if (valido)
                    ESP_LOGI(TAG, "CLOCK_VALID=true (epoch_ms=%llu): la caducidad "
                                  "de comandos ya se verifica",
                             (unsigned long long)epoch);
                else
                    ESP_LOGW(TAG, "CLOCK_VALID=false: sin hora de pared; el "
                                  "repertorio 'act' de mantenimiento se rechaza");
            }
        }

        if (now - last_versionr_us >= DIANA_VERSIONR_PERIOD_US) {
            last_versionr_us = now;
            uint8_t vr = 0;
            diana_w5500_version_class vcls = DIANA_W5500_VERSION_READ_ERROR;
            int vrc = diana_platform_eth_versionr(a->pf, &vr, &vcls);
            if (vrc == 0 && vcls == DIANA_W5500_VERSION_OK) {
                ESP_LOGI(TAG, "W5500 VERSIONR=0x%02x (%s)", (unsigned)vr,
                         diana_w5500_version_class_str(vcls));
            } else if (vrc != -1) {
                ESP_LOGW(TAG, "W5500 VERSIONR=0x%02x (%s)", (unsigned)vr,
                         diana_w5500_version_class_str(vcls));
            }
        }

        vTaskDelay(pdMS_TO_TICKS(a->cfg.telemetry_interval_ms));
    }
}
